<a href="https://colab.research.google.com/github/TruongScotl/LearnPython_for_data_analysis/blob/main/Learn_data_clearning_and_preparation_ipynbp.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Handling Missing Data

In [2]:
import pandas as pd 
import numpy as np
from numpy import nan as NA

In [2]:
string_data = pd.Series(['Truong','Son',np.nan,'Tien'])
string_data

0    Truong
1       Son
2       NaN
3      Tien
dtype: object

In [3]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [6]:
data = pd.Series([1,NA,3.5,NA,7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [7]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [16]:
data= pd.DataFrame([[1.,2.,4.],[2.,NA,NA],[NA,NA,NA],[NA,6.7,4.]])
cleaned = data.dropna()
data
cleaned
#drop rows that are all NA:
cleaned = data.dropna(how='all')
cleaned

     0    1    2
0  1.0  2.0  4.0
1  2.0  NaN  NaN
3  NaN  6.7  4.0

In [18]:
data[4]= NA
data
data.dropna(axis=1,how='all')

     0    1    2
0  1.0  2.0  4.0
1  2.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.7  4.0

In [21]:
df = pd.DataFrame(np.random.randn(7,3))
df.iloc[:4,1]= NA
df.iloc[:2,2]= NA
df
df.dropna()
df.dropna(thresh=2)

          0         1         2
2  0.526774       NaN  0.772900
3 -1.129077       NaN -0.267980
4 -1.451863  0.425076 -0.211360
5  0.482514  0.755266 -0.501541
6 -2.106395  1.226975 -0.225181

Filling In Missing Data

In [23]:
df.fillna(0)
#fillna with a dict, you can use different fill value for each column
df.fillna({1:0.5,2:0})

          0         1         2
0  1.086350  0.500000  0.000000
1 -0.559348  0.500000  0.000000
2  0.526774  0.500000  0.772900
3 -1.129077  0.500000 -0.267980
4 -1.451863  0.425076 -0.211360
5  0.482514  0.755266 -0.501541
6 -2.106395  1.226975 -0.225181

In [24]:
#fillna return a new object, but you can modify the existing object in-place
_= df.fillna(0,inplace=True)
df

          0         1         2
0  1.086350  0.000000  0.000000
1 -0.559348  0.000000  0.000000
2  0.526774  0.000000  0.772900
3 -1.129077  0.000000 -0.267980
4 -1.451863  0.425076 -0.211360
5  0.482514  0.755266 -0.501541
6 -2.106395  1.226975 -0.225181

In [30]:
df = pd.DataFrame(np.random.randn(6,3))
df.iloc[2:, 1]=NA
df.iloc[4:, 2]=NA
df
df.fillna(method='ffill')
df.fillna(method='ffill',limit=2)

          0         1         2
0 -1.712700  0.647439  1.604645
1 -0.831630  0.387523  0.184936
2 -0.776162  0.387523  0.159716
3 -0.136794  0.387523  0.383151
4  0.194355       NaN  0.383151
5 -1.826336       NaN  0.383151

In [31]:
data = pd.Series([1.,NA,3.5,NA,7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

Removing Duplicates

In [5]:
data = pd.DataFrame({'k1':['one','two']*3+['two'],
                     'k2':[1,1,2,3,3,4,4,]})
data
data.duplicated()
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [7]:
data['v1'] = range(7)
#duplicated only on k1 column
data.drop_duplicates(['k1'])
data.drop_duplicates(['k1','k2'],keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

Transforming Data Using a Function or Mapping

In [5]:
data = pd.DataFrame({'food':['bacon','pulled pork','bacon',
                             'Pastrami','corned beef','Bacon',
                             'pastrami','honey ham','nova lox'],
                     'ounces':[4,3,12,7,7.5,8,3,5,6]})
data
meat_to_animal = {'bacon':'pig',
                  'pulled pork':'pig',
                  'pastrami':'cow',
                  'corned beef':'cow',
                  'honey ham':'pig',
                  'nova lox':'salmon'}
#need to convert each value to lowercase using the str.lower
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [8]:
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     7.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [10]:
data['food'].map(lambda x:meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object